import { primaryFilter, excludeFilter } from '../config.js';

import { describe, it, expect } from 'vitest';

describe('primaryFilter', () => {
  const matchCases = [
    `Сумщина:
      4 шахеди на Лебедин
      1 шахед на Конотоп
      Полтавщина:
      3 шахеди на Гадяч
      1 шахед на Диканьку
      1 шахед на Пирятин
      Київщина :
      5 шахедів на Яготин
      Чернігівщина:
      2 шахеди на Ніжин
      1 шахед на Короп
      Черкащина:
      1 шахед на Чигирин`,
    'Стратегічні бомбардувальники в повітрі',
    'Летить у напрямку Сміли',
    'Є зміна курсу на Київську область',
    'Щось летить у Київській області',
    'Рух у бік Полтавщини',
    'Фіксується проліт над Кропивницьким',
    'Біла Церква – можливий поворот',
    'Помічено Ту-95 у повітрі',
    'Запуск Х-101 зафіксовано',
    'Калібри летять',
    'Бомбардувальник Ту-160 активний',
    'Стратегічна авіація піднята',
    'Ракета рухається у бік Умані',
    'Попередньо відбулись пуски ракет з Ту-160',
    `⚠️ 8х БпЛА ланкою на Полтавщину з Сумщини.⚠️ 8х БпЛА ланкою з ТОТ Херсонщини в акваторію Чорного моря.`,
    'Входження крилатих ракет (далі КР) у повітряний простір України',
    '1 група КР через Миколаївщину, вектор Баштанський район',
    'Шахед рухається через Черкаську область',
    '❗️Повышенная угроза пусков ракет "Калибр" этой ночью. Оба ракетоносителя выходят из Цемесского залива',
  ];

  const nonMatchCases = [
    'У Харкові гучні вибухи',
    'Львів без змін',
    'Одеса повідомляє про ситуацію',
    'Миколаївська область',
    'Херсон сьогодні тихо',
    'Шахед над Миколаєвом',
    'Бойова робота ППО в Донецькій області',
    '🚀Пуски КАБ на Харківщину.',
    'Активність ворожої тактичної авіації на північно-східному напрямку Загроза КАБ',
    'Жительница Покровска, бегающая на беговой дорожке, попала в объектив украинского БПЛА 😐 Война войной, а спорт по расписанию. Подписаться на INSIDER UA | Прислать контент',
    'Київ під атакою КР',
    'Дніпропетровщина: БпЛА на Черкаське',
    'Пуск Кинджалу',
    'Пуск Кинджалів',
    'Пуск Кинжала',
  ];

  it('should match correct cases', () => {
    for (const text of matchCases) {
      expect(
        new RegExp(primaryFilter).test(text) &&
          !new RegExp(excludeFilter).test(text),
        `Failed to match:\n${text}`
      ).toBe(true);
    }
  });

  it('should NOT match irrelevant cases', () => {
    for (const text of nonMatchCases) {
      expect(
        new RegExp(primaryFilter).test(text) &&
          !new RegExp(excludeFilter).test(text),
        `Incorrectly matched:\n${text}`
      ).toBe(false);
    }
  });
});
